brew "bat"
brew "eza"
brew "fzf"
brew "mise"
brew "pwgen"
brew "zellij"

if OS.linux?
  brew "docker-compose"
  brew "jq"
  brew "zsh"
end

if OS.mac?
  brew "mas"
  cask "1password"
  cask "choosy"
  cask "google-chrome"
  cask "karabiner-elements"
  cask "microsoft-edge"
  cask "slack"
  cask "visual-studio-code"
  cask "zoom"
end
