brew "awscli"
brew "awslogs"
brew "bat"
brew "docker-compose" if OS.linux?
brew "eza"
brew "fzf"
brew "jq" if OS.linux?
brew "mise"
brew "pwgen"
brew "ripgrep"
brew "zellij"
brew "zsh-autocomplete"
brew "zsh-completions"

brew "gnupg" if OS.linux? # for `mise install node`

if OS.mac?
  brew "mas"
  cask "1password"
  cask "autodesk-fusion"
  cask "bambu-studio"
  cask "charles"
  cask "choosy"
  cask "clipy"
  cask "discord"
  cask "google-chrome"
  cask "karabiner-elements"
  cask "microsoft-edge"
  cask "obsidian"
  cask "onedrive"
  cask "slack"
  cask "visual-studio-code"
  cask "windows-app"
  cask "zoom"
end
